emklaus/STM32F103-Sample-Projects-For-System-Workbench-for-STM32/Workspace/STM32F103_SDCard1/src/stm32_spi_usd.c
  /* Send CMD13 (SD_SEND_STATUS) to get SD status */
  SD_SendCmd(SD_CMD_SEND_STATUS, 0, 0xFF);

  Status = SD_ReadByte();
  Status |= (uint16_t)(SD_ReadByte() << 8);

  /* SD chip select high */
  SD_CS_HIGH();

  /* Send dummy byte 0xFF */
  SD_WriteByte(SD_DUMMY_BYTE);

  /* Return status */
  return Status;
}

/**
  * @brief  Put SD in Idle state.
  * @param  None
  * @retval The SD Response: 
  *         - SD_RESPONSE_FAILURE: Sequence failed
  *         - SD_RESPONSE_NO_ERROR: Sequence succeed
  */
SD_Error SD_GoIdleState(void)
{
  /* SD chip select low */
  SD_CS_LOW();
  
  /* Put SD in SPI mode */
  SD_SendCmd(SD_CMD_GO_IDLE_STATE, 0, 0x95);
  
  /* Wait for In Idle State Response (R1 Format) equal to 0x01 */
  if (SD_GetResponse(SD_IN_IDLE_STATE))
  {
    /* No Idle State Response: return response failure */
    return SD_RESPONSE_FAILURE;
  }
  /*---------- Activates the card initialization process -----------*/
  do
  {
    /* SD chip select high */
    SD_CS_HIGH();
    
    /* Send Dummy byte 0xFF */
    SD_WriteByte(SD_DUMMY_BYTE);
    
    /* SD chip select low */
    SD_CS_LOW();
    
    /* Send CMD1 (Activates the card process) until response equal to 0x0 */
    SD_SendCmd(SD_CMD_SEND_OP_COND, 0, 0xFF);
    /* Wait for no error Response (R1 Format) equal to 0x00 */
  }
  while (SD_GetResponse(SD_RESPONSE_NO_ERROR));
  
  /* SD chip select high */
  SD_CS_HIGH();
  
  /* Send dummy byte 0xFF */
  SD_WriteByte(SD_DUMMY_BYTE);
  
  /* Return Sequence succeed */
  return SD_RESPONSE_NO_ERROR;
}

/**
  * @brief  Write a byte on the SD.
  * @param  Data: byte to send.
  * @retval None
  */
uint8_t SD_WriteByte(uint8_t Data)
{
  return STM_SPI_WriteRead(Data);
}

/**
  * @brief  Read a byte from the SD.
  * @param  None
  * @retval The received byte.
  */
uint8_t SD_ReadByte(void)
{
  return STM_SPI_WriteRead (SD_DUMMY_BYTE);
}

/**
  * @}
  */


/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
